In [1]:
import numpy as np
import pandas as pd

In [5]:
index = pd.date_range("1/1/2000",periods=6,freq="h")
index

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:00:00',
               '2000-01-01 02:00:00', '2000-01-01 03:00:00',
               '2000-01-01 04:00:00', '2000-01-01 05:00:00'],
              dtype='datetime64[ns]', freq='h')

In [7]:
s = pd.Series(np.random.randn(5),index=list("abcde"))
s

a   -1.253211
b   -0.180198
c   -0.555487
d    1.430822
e   -2.518148
dtype: float64

In [10]:
df = pd.DataFrame(np.random.randn(6,3),index=index,columns=list("ABC"))
df

                            A         B         C
2000-01-01 00:00:00  0.049903 -0.689743  0.046116
2000-01-01 01:00:00 -0.452357  2.114372  0.563977
2000-01-01 02:00:00 -0.296161  0.464995 -0.507263
2000-01-01 03:00:00  0.774680  0.271086  0.789291
2000-01-01 04:00:00  1.818416  0.905570  1.239388
2000-01-01 05:00:00 -1.627688  0.365248 -2.014741

In [16]:
df.head(2)
df.tail(2)
df[:2]

                            A         B         C
2000-01-01 00:00:00  0.049903 -0.689743  0.046116
2000-01-01 01:00:00 -0.452357  2.114372  0.563977

In [17]:
df.shape

(6, 3)

In [23]:
df.columns = [x.lower() for x in df.columns]
df

                            a         b         c
2000-01-01 00:00:00  0.049903 -0.689743  0.046116
2000-01-01 01:00:00 -0.452357  2.114372  0.563977
2000-01-01 02:00:00 -0.296161  0.464995 -0.507263
2000-01-01 03:00:00  0.774680  0.271086  0.789291
2000-01-01 04:00:00  1.818416  0.905570  1.239388
2000-01-01 05:00:00 -1.627688  0.365248 -2.014741

In [34]:
df.to_numpy()
df_np = np.asarray(df)
np.may_share_memory(df.values,df_np)

True

In [29]:
pd.Series(pd.date_range("2000", periods=2, tz="CET"))

0   2000-01-01 00:00:00+01:00
1   2000-01-02 00:00:00+01:00
dtype: datetime64[ns, CET]

In [36]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a  0.237941  1.402817       NaN
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [38]:
row = df.iloc[1]
row

one     -0.486523
two     -0.647907
three    1.076648
Name: b, dtype: float64

In [40]:
column = df["two"]
column

a    1.402817
b   -0.647907
c   -1.088699
d   -1.217484
Name: two, dtype: float64

In [45]:
df.sub(row,axis="columns")
df.sub(row,axis=1)

        one       two     three
a  0.724464  2.050724       NaN
b  0.000000  0.000000  0.000000
c  1.757825 -0.440792 -1.785224
d       NaN -0.569577 -1.700454

In [47]:
df.sub(column,axis=0)
df.sub(column,axis="index")

        one  two     three
a -1.164877  0.0       NaN
b  0.161384  0.0  1.724555
c  2.360001  0.0  0.380123
d       NaN  0.0  0.593678

In [49]:
df2 = df.copy()
df2

        one       two     three
a  0.237941  1.402817       NaN
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [52]:
df2.loc["a","three"] = 1.0
df2

        one       two     three
a  0.237941  1.402817  1.000000
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [53]:
df

        one       two     three
a  0.237941  1.402817       NaN
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [54]:
df+df2

        one       two     three
a  0.475881  2.805634       NaN
b -0.973046 -1.295813  2.153297
c  2.542604 -2.177397 -1.417151
d       NaN -2.434967 -1.247611

In [56]:
df.add(df2,fill_value=0)

        one       two     three
a  0.475881  2.805634  1.000000
b -0.973046 -1.295813  2.153297
c  2.542604 -2.177397 -1.417151
d       NaN -2.434967 -1.247611

In [58]:
df.eq(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [60]:
df>0

     one    two  three
a   True   True  False
b  False  False   True
c   True  False  False
d  False  False  False

In [62]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

In [63]:
np.nan == np.nan

False

In [64]:
(df+df).equals(df*2)

True

In [67]:
(df+df==df*2).all().all()

False

In [70]:
pd.Series(["foo", "bar", "baz"]) == pd.Index(["foo", "bar", "qux"])

0     True
1     True
2    False
dtype: bool

In [71]:
df

        one       two     three
a  0.237941  1.402817       NaN
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [74]:
df.sum(axis=0,skipna=True)

one      1.022720
two     -1.551272
three   -0.255732
dtype: float64

In [80]:
df.sum(axis=1,skipna=True)

a    1.640758
b   -0.057781
c   -0.525972
d   -1.841289
dtype: float64

In [80]:
df.sum(axis=1,skipna=True)

a    1.640758
b   -0.057781
c   -0.525972
d   -1.841289
dtype: float64

In [81]:

df

        one       two     three
a  0.237941  1.402817       NaN
b -0.486523 -0.647907  1.076648
c  1.271302 -1.088699 -0.708575
d       NaN -1.217484 -0.623805

In [86]:
df.mean(0)

one      0.340907
two     -0.387818
three   -0.085244
dtype: float64

In [83]:
df-df.mean()

        one       two     three
a -0.102966  1.790635       NaN
b -0.827430 -0.260089  1.161893
c  0.930396 -0.700881 -0.623331
d       NaN -0.829666 -0.538561

In [84]:
df.std()

one      0.883425
two      1.218414
three    1.007121
dtype: float64

In [88]:
df.cumsum(skipna=True)

        one       two     three
a  0.237941  1.402817       NaN
b -0.248582  0.754911  1.076648
c  1.022720 -0.333788  0.368073
d       NaN -1.551272 -0.255732

In [93]:
df.count()

one      3
two      4
three    3
dtype: int64

In [94]:
df.describe()

            one       two     three
count  3.000000  4.000000  3.000000
mean   0.340907 -0.387818 -0.085244
std    0.883425  1.218414  1.007121
min   -0.486523 -1.217484 -0.708575
25%   -0.124291 -1.120895 -0.666190
50%    0.237941 -0.868303 -0.623805
75%    0.754621 -0.135226  0.226422
max    1.271302  1.402817  1.076648

In [97]:
s = pd.Series(["a", "a", "b", "b", "a", "a", np.nan, "c", "d", "a"])
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [99]:
frame = pd.DataFrame({"a": ["Yes", "Yes", "No", "No"], "b": range(4)})
frame

     a  b
0  Yes  0
1  Yes  1
2   No  2
3   No  3

In [100]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [103]:
s1 = pd.Series(np.random.randn(5))
s1

0   -2.142825
1    1.949919
2   -0.440903
3    0.753364
4    0.663010
dtype: float64

In [106]:
s1.idxmin

<bound method Series.idxmin of 0   -2.142825
1    1.949919
2   -0.440903
3    0.753364
4    0.663010
dtype: float64>

In [111]:
data = np.random.randint(0, 7, size=50)
s = pd.Series(data)
s.value_counts()

5    14
4     8
6     8
0     7
1     6
3     5
2     2
Name: count, dtype: int64

In [114]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])
s5.mode()

0    3
1    7
dtype: int64

In [116]:
arr = np.random.randn(20)
arr

array([-0.61775216,  1.95383396, -0.17297942, -2.74527806, -1.51903712,
       -1.91418513,  0.11160013, -0.60720409,  2.30818257,  0.66148321,
        0.93532347, -0.83094168,  0.6737884 , -2.05958439, -0.49243315,
        1.14142026,  1.08219051, -0.95189588, -0.87951289, -0.92569205])

In [117]:
factor = pd.cut(arr,4)
factor

[(-1.482, -0.219], (1.045, 2.308], (-0.219, 1.045], (-2.75, -1.482], (-2.75, -1.482], ..., (1.045, 2.308], (1.045, 2.308], (-1.482, -0.219], (-1.482, -0.219], (-1.482, -0.219]]
Length: 20
Categories (4, interval[float64, right]): [(-2.75, -1.482] < (-1.482, -0.219] < (-0.219, 1.045] < (1.045, 2.308]]

In [136]:
n = 5
tsdf = pd.DataFrame(
    np.random.randn(n,3),
    columns=list("ABC"),
    index = pd.date_range("1/1/2000", periods=n)
)
tsdf.apply(lambda x:x.idxmax())

A   2000-01-05
B   2000-01-01
C   2000-01-03
dtype: datetime64[ns]

In [137]:
tsdf.axes

[DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
                '2000-01-05'],
               dtype='datetime64[ns]', freq='D'),
 Index(['A', 'B', 'C'], dtype='object')]

In [138]:
for rowi,row in tsdf.iterrows():
    print(rowi)
    print(row)
    print(type(row))
    print("=============")

2000-01-01 00:00:00
A    0.181794
B    0.769987
C    0.036461
Name: 2000-01-01 00:00:00, dtype: float64
<class 'pandas.core.series.Series'>
=============
2000-01-02 00:00:00
A   -0.067546
B   -0.639606
C    0.128867
Name: 2000-01-02 00:00:00, dtype: float64
<class 'pandas.core.series.Series'>
=============
2000-01-03 00:00:00
A    0.432618
B    0.453197
C    0.517343
Name: 2000-01-03 00:00:00, dtype: float64
<class 'pandas.core.series.Series'>
=============
2000-01-04 00:00:00
A   -0.818452
B   -1.275087
C   -1.223616
Name: 2000-01-04 00:00:00, dtype: float64
<class 'pandas.core.series.Series'>
=============
2000-01-05 00:00:00
A    2.011271
B   -0.055438
C   -0.062674
Name: 2000-01-05 00:00:00, dtype: float64
<class 'pandas.core.series.Series'>
=============

In [140]:
tsdf.iloc[2:3] = np.nan
tsdf

                   A         B         C
2000-01-01  0.181794  0.769987  0.036461
2000-01-02 -0.067546 -0.639606  0.128867
2000-01-03       NaN       NaN       NaN
2000-01-04 -0.818452 -1.275087 -1.223616
2000-01-05  2.011271 -0.055438 -0.062674

In [141]:
tsdf.agg(lambda x:np.sum(x))

A    1.307067
B   -1.200144
C   -1.120961
dtype: float64

In [146]:
tsdf['A'].agg(["sum",lambda x: x.mean()])

sum         1.307067
<lambda>    0.326767
Name: A, dtype: float64

In [150]:
tsdf.transform([np.abs,lambda x:x+1])

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2000-01-01  0.181794  1.181794  0.769987  1.769987  0.036461  1.036461
2000-01-02  0.067546  0.932454  0.639606  0.360394  0.128867  1.128867
2000-01-03       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-04  0.818452  0.181548  1.275087 -0.275087  1.223616 -0.223616
2000-01-05  2.011271  3.011271  0.055438  0.944562  0.062674  0.937326